---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidSelectionThereCannotBeOpenConnectors
source: html/b6aa5628-fd45-a1a2-c06a-956e950eefef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.InvalidSelectionThereCannotBeOpenConnectors Property

Invalid selection there cannot be any open connectors for the design to fabrication part tool.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSelectionThereCannotBeOpenConnectors { get; }
```